{
  "school_key": "the_international_school_of_kuala_lumpur_iskl",
  "school_name": "The International School of Kuala Lumpur (ISKL)",
  "website_url": "https://www.iskl.edu.my/",
  "extracted_at": "2026-02-06T21:23:50.645195+00:00",
  "social_links": {},
  "emails": {
    "admissions_email": "",
    "communications_email": "",
    "general_email": ""
  },
  "travel_keyword_snippets": [
    "No matching trip/off-campus keywords found on this page.",
    "No matching trip/off-campus keywords found on this page.",
    "Field trips and short camps are vital for elementary school students, offering hands-on learning experiences that enrich classroom education. These adventures spark curiosity, foster teamwork, and build independence, allowing students to ex",
    "Find out more about the exciting **[off-campus opportunities](https://www.iskl.edu.my/fs/pages/1043)** for our Elementary School Students.",
    "[Find out more about our Middle School OFF-CAMPUS TRIPS](https://www.iskl.edu.my/fs/pages/1043)",
    "- ### [ISKL's Global Action Program (GAP): Inspiring Global Citizens](https://www.iskl.edu.my/learning/high-school#fs-panel-10951)",
    "The Global Action Program (GAP) at ISKL is an experiential learning initiative that immerses High School students in real-world challenges through hands-on service, cultural exchanges, and environmental projects. Designed to develop global ",
    "- In this unit, students engage in discussions about their personal experiences of going on vacations with their families. They share stories and learn about various interesting places to visit, both locally and internationally.",
    "Preparation for a vacation is also a key topic, where students discuss what to pack and how to plan for a trip. Additionally, students will create travel posters to illustrate and share their dream vacations, integrating their artistic and ",
    "As students further develop an understanding of the importance of learning a new language and exploring a new culture, they learn high-frequency words related to weather, traveling, clothing, and shopping. They engage in conversations as th",
    "Students learn high-frequency words related to travel and transportation. They practice using a map to find places of interest within a city, abd learn how to read schedules and purchase a ticket to travel around a city.",
    "This unit examines the cultural perspectives on travel and vacations, encouraging students to share their travel experiences and preferences."
  ]
}